app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY created_at DESC
---
  def index
    @all_posts = Post.all.order('created_at DESC')

INSERT INTO "posts" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-15 22:24:53.256048"], ["description", "asdf"], ["title", "asdf"], ["updated_at", "2014-12-15 22:24:53.256048"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save